contiki-os/contiki/cc26xxware/inc/hw_event.h
//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL31
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// AUX_COMPA            AUX Compare A event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPA
//
#define EVENT_CPUIRQSEL31_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL31_EV_S                                      0
#define EVENT_CPUIRQSEL31_EV_AUX_COMPA                              0x0000006A

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL32
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// AUX_ADC_IRQ          AUX ADC interrupt event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.ADC_IRQ. Status flags are found here
// [AUX_EVCTL:EVTOMCUFLAGS.ADC*]
//
#define EVENT_CPUIRQSEL32_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL32_EV_S                                      0
#define EVENT_CPUIRQSEL32_EV_AUX_ADC_IRQ                            0x00000073

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL33
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// TRNG_IRQ             TRNG Interrupt event, controlled by TRNG:IRQEN.EN
//
#define EVENT_CPUIRQSEL33_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL33_EV_S                                      0
#define EVENT_CPUIRQSEL33_EV_TRNG_IRQ                               0x00000068

//*****************************************************************************
//
// Register: EVENT_O_RFCSEL0
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// GPT0A_CMP            GPT0A compare event. Configured by GPT0:TAMR.TCACT
//
#define EVENT_RFCSEL0_EV_M                                          0x0000007F
#define EVENT_RFCSEL0_EV_S                                          0
#define EVENT_RFCSEL0_EV_GPT0A_CMP                                  0x0000003D

//*****************************************************************************
//
// Register: EVENT_O_RFCSEL1
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// GPT0B_CMP            GPT0B compare event. Configured by GPT0:TBMR.TCACT
//
#define EVENT_RFCSEL1_EV_M                                          0x0000007F
#define EVENT_RFCSEL1_EV_S                                          0
#define EVENT_RFCSEL1_EV_GPT0B_CMP                                  0x0000003E

//*****************************************************************************
//
// Register: EVENT_O_RFCSEL2
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// GPT1A_CMP            GPT1A compare event. Configured by GPT1:TAMR.TCACT
//
#define EVENT_RFCSEL2_EV_M                                          0x0000007F
#define EVENT_RFCSEL2_EV_S                                          0
#define EVENT_RFCSEL2_EV_GPT1A_CMP                                  0x0000003F

//*****************************************************************************
//
// Register: EVENT_O_RFCSEL3
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// GPT1B_CMP            GPT1B compare event. Configured by GPT1:TBMR.TCACT
//
#define EVENT_RFCSEL3_EV_M                                          0x0000007F
#define EVENT_RFCSEL3_EV_S                                          0
#define EVENT_RFCSEL3_EV_GPT1B_CMP                                  0x00000040

//*****************************************************************************
//
// Register: EVENT_O_RFCSEL4
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// GPT2A_CMP            GPT2A compare event. Configured by GPT2:TAMR.TCACT
//
#define EVENT_RFCSEL4_EV_M                                          0x0000007F
#define EVENT_RFCSEL4_EV_S                                          0
#define EVENT_RFCSEL4_EV_GPT2A_CMP                                  0x00000041

//*****************************************************************************
//
// Register: EVENT_O_RFCSEL5
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// GPT2B_CMP            GPT2B compare event. Configured by GPT2:TBMR.TCACT
//
#define EVENT_RFCSEL5_EV_M                                          0x0000007F
#define EVENT_RFCSEL5_EV_S                                          0
#define EVENT_RFCSEL5_EV_GPT2B_CMP                                  0x00000042

//*****************************************************************************
//
// Register: EVENT_O_RFCSEL6
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// GPT3A_CMP            GPT3A compare event. Configured by GPT3:TAMR.TCACT
//
#define EVENT_RFCSEL6_EV_M                                          0x0000007F
#define EVENT_RFCSEL6_EV_S                                          0
#define EVENT_RFCSEL6_EV_GPT3A_CMP                                  0x00000043

//*****************************************************************************
//
// Register: EVENT_O_RFCSEL7
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// GPT3B_CMP            GPT3B compare event. Configured by GPT3:TBMR.TCACT
//
#define EVENT_RFCSEL7_EV_M                                          0x0000007F
#define EVENT_RFCSEL7_EV_S                                          0
#define EVENT_RFCSEL7_EV_GPT3B_CMP                                  0x00000044

//*****************************************************************************
//
// Register: EVENT_O_RFCSEL8
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// AON_RTC_UPD          RTC periodic event controlled by
// AON_RTC:CTL.RTC_UPD_EN
//
#define EVENT_RFCSEL8_EV_M                                          0x0000007F
#define EVENT_RFCSEL8_EV_S                                          0
#define EVENT_RFCSEL8_EV_AON_RTC_UPD                                0x00000077

//*****************************************************************************
//
// Register: EVENT_O_RFCSEL9
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read/write selection value
// ENUMs:
// NONE                 Always inactive
// AON_PROG0            Event selected by AON_EVENT  MCU event selector,
// AON_EVENT:EVTOMCUSEL.AON_PROG0_EV
// AON_PROG1            Event selected by AON_EVENT MCU event selector,
// AON_EVENT:EVTOMCUSEL.AON_PROG1_EV
// I2S_IRQ              Interrupt event from I2S
// AON_AUX_SWEV0        AUX Software event 0, AUX_EVCTL:SWEVSET.SWEV0
// WDT_IRQ              Watchdog interrupt event, controlled by WDT:CTL.INTEN
// SSI0_COMB            SSI0 combined interrupt, interrupt flags are found here
// SSI0:MIS
// SSI1_COMB            SSI0 combined interrupt, interrupt flags are found here
// SSI1:MIS
// UART0_COMB           UART0 combined interrupt, interrupt flags are found here
// UART0:MIS
// DMA_DONE_COMB        Combined DMA done corresponding flags are here
// UDMA0:REQDONE
// CRYPTO_RESULT_AVAIL_IRQ CRYPTO result available interupt event, the
// corresponding flag is found here CRYPTO:IRQSTAT.RESULT_AVAIL. Controlled by
// CRYPTO:IRQSTAT.RESULT_AVAIL
// SWEV0                Software event 0, triggered by SWEV.SWEV0
// SWEV1                Software event 1, triggered by SWEV.SWEV1
// AUX_AON_WU_EV        AON wakeup event, corresponds flags are here
// AUX_EVCTL:EVTOMCUFLAGS.AON_WU_EV
// AUX_COMPA            AUX Compare A event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPA
// AUX_COMPB            AUX Compare B event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPB
// AUX_TDC_DONE         AUX TDC measurement done event, corresponds to the flag
// AUX_EVCTL:EVTOMCUFLAGS.TDC_DONE and the AUX_TDC status AUX_TDC:STAT.DONE
// AUX_TIMER0_EV        AUX timer 0 event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.TIMER0_EV
// AUX_TIMER1_EV        AUX timer 1 event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.TIMER1_EV
// AUX_SMPH_AUTOTAKE_DONE Autotake event from AUX semaphore, configured by
// AUX_SMPH:AUTOTAKE
// AUX_ADC_DONE         AUX ADC done, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.ADC_DONE
// AUX_ADC_FIFO_ALMOST_FULL AUX ADC FIFO watermark event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.ADC_FIFO_ALMOST_FULL
// AUX_OBSMUX0          Loopback of OBSMUX0 through AUX, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.OBSMUX0
//
// INTERNAL_NOTE:
// [Diagram showing the observtion signal top-level connections, this signal is
// bit 0 of the "to
// AUX"](https://spsemea.itg.ti.com/sites/lpw/proj/CC26xx/Modules/DFT/Observation_Signal_Design_Diagram%20-%20PG2%20-%20Revised%20Proposal.vsd)
// AUX_ADC_IRQ          AUX ADC interrupt event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.ADC_IRQ. Status flags are found here
// [AUX_EVCTL:EVTOMCUFLAGS.ADC*]
// ALWAYS_ACTIVE        Always asserted
//
#define EVENT_RFCSEL9_EV_M                                          0x0000007F
#define EVENT_RFCSEL9_EV_S                                          0
#define EVENT_RFCSEL9_EV_NONE                                       0x00000000
#define EVENT_RFCSEL9_EV_AON_PROG0                                  0x00000001
#define EVENT_RFCSEL9_EV_AON_PROG1                                  0x00000002
#define EVENT_RFCSEL9_EV_I2S_IRQ                                    0x00000008
#define EVENT_RFCSEL9_EV_AON_AUX_SWEV0                              0x0000000A
#define EVENT_RFCSEL9_EV_WDT_IRQ                                    0x00000018
#define EVENT_RFCSEL9_EV_SSI0_COMB                                  0x00000022
#define EVENT_RFCSEL9_EV_SSI1_COMB                                  0x00000023
#define EVENT_RFCSEL9_EV_UART0_COMB                                 0x00000024
#define EVENT_RFCSEL9_EV_DMA_DONE_COMB                              0x00000027
#define EVENT_RFCSEL9_EV_CRYPTO_RESULT_AVAIL_IRQ                    0x0000005D
#define EVENT_RFCSEL9_EV_SWEV0                                      0x00000064
#define EVENT_RFCSEL9_EV_SWEV1                                      0x00000065
#define EVENT_RFCSEL9_EV_AUX_AON_WU_EV                              0x00000069
#define EVENT_RFCSEL9_EV_AUX_COMPA                                  0x0000006A
#define EVENT_RFCSEL9_EV_AUX_COMPB                                  0x0000006B
#define EVENT_RFCSEL9_EV_AUX_TDC_DONE                               0x0000006C
#define EVENT_RFCSEL9_EV_AUX_TIMER0_EV                              0x0000006D
#define EVENT_RFCSEL9_EV_AUX_TIMER1_EV                              0x0000006E
#define EVENT_RFCSEL9_EV_AUX_SMPH_AUTOTAKE_DONE                     0x0000006F
#define EVENT_RFCSEL9_EV_AUX_ADC_DONE                               0x00000070
#define EVENT_RFCSEL9_EV_AUX_ADC_FIFO_ALMOST_FULL                   0x00000071
#define EVENT_RFCSEL9_EV_AUX_OBSMUX0                                0x00000072
#define EVENT_RFCSEL9_EV_AUX_ADC_IRQ                                0x00000073
#define EVENT_RFCSEL9_EV_ALWAYS_ACTIVE                              0x00000079

//*****************************************************************************
//
// Register: EVENT_O_GPT0ACAPTSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read/write selection value
// ENUMs:
// NONE                 Always inactive
// AON_GPIO_EDGE        Edge detect event from IOC. Configureded by the
// [IOC:IOCFGn.EDGE_IRQ_EN] and  [IOC:IOCFGn.EDGE_DET] settings
// AON_SPIS_BYTE_DONE   A complete byte transfer event from the SPIS. Equivalent
// to the SPIS:GPFLAGS.BYTE_DONE flag
// AON_SPIS_CS          SPIS chip select event. Equivalent to the
// SPIS:GPFLAGS.CS flag
// AON_RTC_COMB         Event from AON_RTC controlled by the
// AON_RTC:CTL.COMB_EV_MASK setting
// I2C_IRQ              Interrupt event from I2C
// AUX_COMB             AUX combined event, the corresponding flag register is
// here AUX_EVCTL:EVTOMCUFLAGS
// FLASH                FLASH controller error event,  the status flags are
// FLASH:FEDACSTAT.FSM_DONE and FLASH:FEDACSTAT.RVF_INT
// RFC_CMD_ACK          RFC Doorbell Command Acknowledgement Interrupt,
// equvialent to RFC_DBELL:RFACKIFG.ACKFLAG
// RFC_HW_COMB          Combined RCF hardware interrupt, corresponding flag is
// here RFC_DBELL:RFHWIFG
// RFC_CPE_0            Combined Interrupt for CPE Generated events.
// Corresponding flags are here RFC_DBELL:RFCPEIFG. Only interrupts selected
// with CPE0 in RFC_DBELL:RFCPEIFG can trigger a RFC_CPE_0 event
// RFC_CPE_1            Combined Interrupt for CPE Generated events.
// Corresponding flags are here RFC_DBELL:RFCPEIFG. Only interrupts selected
// with CPE1 in RFC_DBELL:RFCPEIFG can trigger a RFC_CPE_1 event
// SSI0_COMB            SSI0 combined interrupt, interrupt flags are found here
// SSI0:MIS
// SSI1_COMB            SSI0 combined interrupt, interrupt flags are found here
// SSI1:MIS
// UART0_COMB           UART0 combined interrupt, interrupt flags are found here
// UART0:MIS
// GPT0A_CMP            GPT0A compare event. Configured by GPT0:TAMR.TCACT
// GPT0B_CMP            GPT0B compare event. Configured by GPT0:TBMR.TCACT
// GPT1A_CMP            GPT1A compare event. Configured by GPT1:TAMR.TCACT
// GPT1B_CMP            GPT1B compare event. Configured by GPT1:TBMR.TCACT
// GPT2A_CMP            GPT2A compare event. Configured by GPT2:TAMR.TCACT
// GPT2B_CMP            GPT2B compare event. Configured by GPT2:TBMR.TCACT
// GPT3A_CMP            GPT3A compare event. Configured by GPT3:TAMR.TCACT
// GPT3B_CMP            GPT3B compare event. Configured by GPT3:TBMR.TCACT
// PORT_EVENT0          Port capture event from IOC, configured by
// [IOC:IOCFGn.PORT_ID]. Events on ports configured with ENUM PORT_EVENT0 wil be
// routed here.
// PORT_EVENT1          Port capture event from IOC, configured by
// [IOC:IOCFGn.PORT_ID]. Events on ports configured with ENUM PORT_EVENT1 wil be
// routed here.
// RFC_IN_EV4           RFC RAT event 4, configured by RFC_RAT:RATEV.OEVT4
// RFC_IN_EV5           RFC RAT event 5, configured by RFC_RAT:RATEV.OEVT5
// AUX_AON_WU_EV        AON wakeup event, corresponds flags are here
// AUX_EVCTL:EVTOMCUFLAGS.AON_WU_EV
// AUX_COMPA            AUX Compare A event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPA
// AUX_COMPB            AUX Compare B event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPB
// AUX_TDC_DONE         AUX TDC measurement done event, corresponds to the flag
// AUX_EVCTL:EVTOMCUFLAGS.TDC_DONE and the AUX_TDC status AUX_TDC:STAT.DONE
// AUX_TIMER0_EV        AUX timer 0 event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.TIMER0_EV
// AUX_TIMER1_EV        AUX timer 1 event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.TIMER1_EV
// AUX_SMPH_AUTOTAKE_DONE Autotake event from AUX semaphore, configured by
// AUX_SMPH:AUTOTAKE
// AUX_ADC_DONE         AUX ADC done, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.ADC_DONE
// AUX_ADC_FIFO_ALMOST_FULL AUX ADC FIFO watermark event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.ADC_FIFO_ALMOST_FULL
// AUX_OBSMUX0          Loopback of OBSMUX0 through AUX, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.OBSMUX0
//
// INTERNAL_NOTE:
// [Diagram showing the observtion signal top-level connections, this signal is
// bit 0 of the "to
// AUX"](https://spsemea.itg.ti.com/sites/lpw/proj/CC26xx/Modules/DFT/Observation_Signal_Design_Diagram%20-%20PG2%20-%20Revised%20Proposal.vsd)
// AUX_ADC_IRQ          AUX ADC interrupt event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.ADC_IRQ. Status flags are found here
// [AUX_EVCTL:EVTOMCUFLAGS.ADC*]
// AON_RTC_UPD          RTC periodic event controlled by
// AON_RTC:CTL.RTC_UPD_EN
// ALWAYS_ACTIVE        Always asserted
//
#define EVENT_GPT0ACAPTSEL_EV_M                                     0x0000007F
#define EVENT_GPT0ACAPTSEL_EV_S                                     0
#define EVENT_GPT0ACAPTSEL_EV_NONE                                  0x00000000
#define EVENT_GPT0ACAPTSEL_EV_AON_GPIO_EDGE                         0x00000004
#define EVENT_GPT0ACAPTSEL_EV_AON_SPIS_BYTE_DONE                    0x00000005
#define EVENT_GPT0ACAPTSEL_EV_AON_SPIS_CS                           0x00000006
#define EVENT_GPT0ACAPTSEL_EV_AON_RTC_COMB                          0x00000007
#define EVENT_GPT0ACAPTSEL_EV_I2C_IRQ                               0x00000009
#define EVENT_GPT0ACAPTSEL_EV_AUX_COMB                              0x0000000B
#define EVENT_GPT0ACAPTSEL_EV_FLASH                                 0x00000015
#define EVENT_GPT0ACAPTSEL_EV_RFC_CMD_ACK                           0x00000019
#define EVENT_GPT0ACAPTSEL_EV_RFC_HW_COMB                           0x0000001A
#define EVENT_GPT0ACAPTSEL_EV_RFC_CPE_0                             0x0000001B
#define EVENT_GPT0ACAPTSEL_EV_RFC_CPE_1                             0x0000001E
#define EVENT_GPT0ACAPTSEL_EV_SSI0_COMB                             0x00000022
#define EVENT_GPT0ACAPTSEL_EV_SSI1_COMB                             0x00000023
#define EVENT_GPT0ACAPTSEL_EV_UART0_COMB                            0x00000024
#define EVENT_GPT0ACAPTSEL_EV_GPT0A_CMP                             0x0000003D
#define EVENT_GPT0ACAPTSEL_EV_GPT0B_CMP                             0x0000003E
#define EVENT_GPT0ACAPTSEL_EV_GPT1A_CMP                             0x0000003F
#define EVENT_GPT0ACAPTSEL_EV_GPT1B_CMP                             0x00000040
#define EVENT_GPT0ACAPTSEL_EV_GPT2A_CMP                             0x00000041
#define EVENT_GPT0ACAPTSEL_EV_GPT2B_CMP                             0x00000042
#define EVENT_GPT0ACAPTSEL_EV_GPT3A_CMP                             0x00000043
#define EVENT_GPT0ACAPTSEL_EV_GPT3B_CMP                             0x00000044
#define EVENT_GPT0ACAPTSEL_EV_PORT_EVENT0                           0x00000055
#define EVENT_GPT0ACAPTSEL_EV_PORT_EVENT1                           0x00000056
#define EVENT_GPT0ACAPTSEL_EV_RFC_IN_EV4                            0x0000005F
#define EVENT_GPT0ACAPTSEL_EV_RFC_IN_EV5                            0x00000060
#define EVENT_GPT0ACAPTSEL_EV_AUX_AON_WU_EV                         0x00000069
#define EVENT_GPT0ACAPTSEL_EV_AUX_COMPA                             0x0000006A
#define EVENT_GPT0ACAPTSEL_EV_AUX_COMPB                             0x0000006B
#define EVENT_GPT0ACAPTSEL_EV_AUX_TDC_DONE                          0x0000006C
#define EVENT_GPT0ACAPTSEL_EV_AUX_TIMER0_EV                         0x0000006D
#define EVENT_GPT0ACAPTSEL_EV_AUX_TIMER1_EV                         0x0000006E
#define EVENT_GPT0ACAPTSEL_EV_AUX_SMPH_AUTOTAKE_DONE                0x0000006F
#define EVENT_GPT0ACAPTSEL_EV_AUX_ADC_DONE                          0x00000070
#define EVENT_GPT0ACAPTSEL_EV_AUX_ADC_FIFO_ALMOST_FULL              0x00000071
#define EVENT_GPT0ACAPTSEL_EV_AUX_OBSMUX0                           0x00000072
#define EVENT_GPT0ACAPTSEL_EV_AUX_ADC_IRQ                           0x00000073
#define EVENT_GPT0ACAPTSEL_EV_AON_RTC_UPD                           0x00000077
#define EVENT_GPT0ACAPTSEL_EV_ALWAYS_ACTIVE                         0x00000079

