contiki-os/contiki/cc26xxware/inc/hw_event.h
//*****************************************************************************
//
// Register: EVENT_O_UDMACH14BSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read/write selection value
// ENUMs:
// NONE                 Always inactive
// AON_PROG0            Event selected by AON_EVENT  MCU event selector,
// AON_EVENT:EVTOMCUSEL.AON_PROG0_EV
// AON_PROG1            Event selected by AON_EVENT MCU event selector,
// AON_EVENT:EVTOMCUSEL.AON_PROG1_EV
// AON_PROG2            Event selected by AON_EVENT MCU event selector,
// AON_EVENT:EVTOMCUSEL.AON_PROG2_EV
// AON_GPIO_EDGE        Edge detect event from IOC. Configureded by the
// [IOC:IOCFGn.EDGE_IRQ_EN] and  [IOC:IOCFGn.EDGE_DET] settings
// AON_SPIS_BYTE_DONE   A complete byte transfer event from the SPIS. Equivalent
// to the SPIS:GPFLAGS.BYTE_DONE flag
// AON_SPIS_CS          SPIS chip select event. Equivalent to the
// SPIS:GPFLAGS.CS flag
// AON_RTC_COMB         Event from AON_RTC controlled by the
// AON_RTC:CTL.COMB_EV_MASK setting
// I2S_IRQ              Interrupt event from I2S
// I2C_IRQ              Interrupt event from I2C
// AON_AUX_SWEV0        AUX Software event 0, AUX_EVCTL:SWEVSET.SWEV0
// AUX_COMB             AUX combined event, the corresponding flag register is
// here AUX_EVCTL:EVTOMCUFLAGS
// GPT2A                GPT2A interrupt event, controlled by GPT2:TAMR
// GPT2B                GPT2B interrupt event, controlled by GPT2:TBMR
// GPT3A                GPT3A interrupt event, controlled by GPT3:TAMR
// GPT3B                GPT3B interrupt event, controlled by GPT3:TBMR
// GPT0A                GPT0A interrupt event, controlled by GPT0:TAMR
// GPT0B                GPT0B interrupt event, controlled by GPT0:TBMR
// GPT1A                GPT1A interrupt event, controlled by GPT1:TAMR
// GPT1B                GPT1B interrupt event, controlled by GPT1:TBMR
// DMA_CH0_DONE         DMA done for software tiggered UDMA channel 0, see
// UDMA0:SOFTREQ
// FLASH                FLASH controller error event,  the status flags are
// FLASH:FEDACSTAT.FSM_DONE and FLASH:FEDACSTAT.RVF_INT
// DMA_CH18_DONE        DMA done for software tiggered UDMA channel 18, see
// UDMA0:SOFTREQ
// WDT_IRQ              Watchdog interrupt event, controlled by WDT:CTL.INTEN
// RFC_CMD_ACK          RFC Doorbell Command Acknowledgement Interrupt,
// equvialent to RFC_DBELL:RFACKIFG.ACKFLAG
// RFC_HW_COMB          Combined RCF hardware interrupt, corresponding flag is
// here RFC_DBELL:RFHWIFG
// RFC_CPE_0            Combined Interrupt for CPE Generated events.
// Corresponding flags are here RFC_DBELL:RFCPEIFG. Only interrupts selected
// with CPE0 in RFC_DBELL:RFCPEIFG can trigger a RFC_CPE_0 event
// AUX_SWEV1            AUX software event 1, triggered by
// AUX_EVCTL:SWEVSET.SWEV1, also available as AUX_EVENT2 AON wake up event.
// MCU domain wakeup control AON_EVENT:MCUWUSEL
// AUX domain wakeup control AON_EVENT:AUXWUSEL
//
// INTERNAL_NOTE:
// Intended to be used as error event from AUX to AON and MCU
// Can be used as a wakeup event for AON
// RFC_CPE_1            Combined Interrupt for CPE Generated events.
// Corresponding flags are here RFC_DBELL:RFCPEIFG. Only interrupts selected
// with CPE1 in RFC_DBELL:RFCPEIFG can trigger a RFC_CPE_1 event
// SSI0_COMB            SSI0 combined interrupt, interrupt flags are found here
// SSI0:MIS
// SSI1_COMB            SSI0 combined interrupt, interrupt flags are found here
// SSI1:MIS
// UART0_COMB           UART0 combined interrupt, interrupt flags are found here
// UART0:MIS
// DMA_ERR              DMA bus error, corresponds to UDMA0:ERROR.STATUS
// DMA_DONE_COMB        Combined DMA done corresponding flags are here
// UDMA0:REQDONE
// SSI0_RX_DMABREQ      SSI0 RX DMA burst request , controlled by
// SSI0:DMACR.RXDMAE
// SSI0_RX_DMASREQ      SSI0 RX DMA single request, controlled by
// SSI0:DMACR.RXDMAE
// SSI0_TX_DMABREQ      SSI0 TX DMA burst request , controlled by
// SSI0:DMACR.TXDMAE
// SSI0_TX_DMASREQ      SSI0 TX DMA single request, controlled by
// SSI0:DMACR.TXDMAE
// SSI1_RX_DMABREQ      SSI1 RX DMA burst request , controlled by
// SSI0:DMACR.RXDMAE
// SSI1_RX_DMASREQ      SSI1 RX DMA single request, controlled by
// SSI0:DMACR.RXDMAE
// SSI1_TX_DMABREQ      SSI1 TX DMA burst request , controlled by
// SSI0:DMACR.TXDMAE
// SSI1_TX_DMASREQ      SSI1 TX DMA single request, controlled by
// SSI0:DMACR.TXDMAE
// UART0_RX_DMABREQ     UART0 RX DMA burst request, controlled by
// UART0:DMACTL.RXDMAE
// UART0_RX_DMASREQ     UART0 RX DMA single request, controlled by
// UART0:DMACTL.RXDMAE
// UART0_TX_DMABREQ     UART0 TX DMA burst request, controlled by
// UART0:DMACTL.TXDMAE
// UART0_TX_DMASREQ     UART0 TX DMA single request, controlled by
// UART0:DMACTL.TXDMAE
// SPIS_COMB            SPIS Combined event, the flags are found here
// SPIS:GPFLAGS
// SPIS_RXF_DMABREQ     SPIS RX FIFO DMA burst request, controlled by
// SPIS:CFG.TR_DMA_REQ_TYPE
// SPIS_RXF_DMASREQ     SPIS RX FIFO DMA single request, controlled by
// SPIS:CFG.TR_DMA_REQ_TYPE
// SPIS_TXF_DMABREQ     SPIS TX FIFO DMA burst request, controlled by
// SPIS:CFG.TX_DMA_REQ_TYPE
// SPIS_TXF_DMASREQ     SPIS TX FIFO DMA single request, controlled by
// SPIS:CFG.TX_DMA_REQ_TYPE
// GPT0A_CMP            GPT0A compare event. Configured by GPT0:TAMR.TCACT
// GPT0B_CMP            GPT0B compare event. Configured by GPT0:TBMR.TCACT
// GPT1A_CMP            GPT1A compare event. Configured by GPT1:TAMR.TCACT
// GPT1B_CMP            GPT1B compare event. Configured by GPT1:TBMR.TCACT
// GPT2A_CMP            GPT2A compare event. Configured by GPT2:TAMR.TCACT
// GPT2B_CMP            GPT2B compare event. Configured by GPT2:TBMR.TCACT
// GPT3A_CMP            GPT3A compare event. Configured by GPT3:TAMR.TCACT
// GPT3B_CMP            GPT3B compare event. Configured by GPT3:TBMR.TCACT
// GPT0A_DMABREQ        GPT0A DMA trigger event. Configured by GPT0:DMAEV
// GPT0B_DMABREQ        GPT0B DMA trigger event. Configured by GPT0:DMAEV
// GPT1A_DMABREQ        GPT1A DMA trigger event. Configured by GPT1:DMAEV
// GPT1B_DMABREQ        GPT1B DMA trigger event. Configured by GPT1:DMAEV
// GPT2A_DMABREQ        GPT2A DMA trigger event. Configured by GPT2:DMAEV
// GPT2B_DMABREQ        GPT2B DMA trigger event. Configured by GPT2:DMAEV
// GPT3A_DMABREQ        GPT3A DMA trigger event. Configured by GPT3:DMAEV
// GPT3B_DMABREQ        GPT3B DMA trigger event. Configured by GPT3:DMAEV
// PORT_EVENT0          Port capture event from IOC, configured by
// [IOC:IOCFGn.PORT_ID]. Events on ports configured with ENUM PORT_EVENT0 wil be
// routed here.
// PORT_EVENT1          Port capture event from IOC, configured by
// [IOC:IOCFGn.PORT_ID]. Events on ports configured with ENUM PORT_EVENT1 wil be
// routed here.
// PORT_EVENT2          Port capture event from IOC, configured by
// [IOC:IOCFGn.PORT_ID]. Events on ports configured with ENUM PORT_EVENT2 wil be
// routed here.
// PORT_EVENT3          Port capture event from IOC, configured by
// [IOC:IOCFGn.PORT_ID]. Events on ports configured with ENUM PORT_EVENT3 wil be
// routed here.
// PORT_EVENT4          Port capture event from IOC, configured by
// [IOC:IOCFGn.PORT_ID]. Events on ports configured with ENUM PORT_EVENT4 wil be
// routed here.
// PORT_EVENT5          Port capture event from IOC, configured by
// [IOC:IOCFGn.PORT_ID]. Events on ports configured with ENUM PORT_EVENT4 wil be
// routed here.
// PORT_EVENT6          Port capture event from IOC, configured by
// [IOC:IOCFGn.PORT_ID]. Events on ports configured with ENUM PORT_EVENT6 wil be
// routed here.
// PORT_EVENT7          Port capture event from IOC, configured by
// [IOC:IOCFGn.PORT_ID]. Events on ports configured with ENUM PORT_EVENT7 wil be
// routed here.
// CRYPTO_RESULT_AVAIL_IRQ CRYPTO result available interupt event, the
// corresponding flag is found here CRYPTO:IRQSTAT.RESULT_AVAIL. Controlled by
// CRYPTO:IRQSTAT.RESULT_AVAIL
// CRYPTO_DMA_DONE_IRQ  CRYPTO DMA input done event, the correspondingg flag is
// CRYPTO:IRQSTAT.DMA_IN_DONE. Controlled by CRYPTO:IRQEN.DMA_IN_DONE
// RFC_IN_EV4           RFC RAT event 4, configured by RFC_RAT:RATEV.OEVT4
// RFC_IN_EV5           RFC RAT event 5, configured by RFC_RAT:RATEV.OEVT5
// RFC_IN_EV6           RFC RAT event 6, configured by RFC_RAT:RATEV.OEVT6
// RFC_IN_EV7           RFC RAT event 7, configured by RFC_RAT:RATEV.OEVT7
// WDT_NMI              Watchdog non maskable interrupt event, controlled by
// WDT:CTL.INTTYPE
// SWEV0                Software event 0, triggered by SWEV.SWEV0
// SWEV1                Software event 1, triggered by SWEV.SWEV1
// SWEV2                Software event 2, triggered by SWEV.SWEV2
// SWEV3                Software event 3, triggered by SWEV.SWEV3
// TRNG_IRQ             TRNG Interrupt event, controlled by TRNG:IRQEN.EN
// AUX_AON_WU_EV        AON wakeup event, corresponds flags are here
// AUX_EVCTL:EVTOMCUFLAGS.AON_WU_EV
// AUX_COMPA            AUX Compare A event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPA
// AUX_COMPB            AUX Compare B event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPB
// AUX_TDC_DONE         AUX TDC measurement done event, corresponds to the flag
// AUX_EVCTL:EVTOMCUFLAGS.TDC_DONE and the AUX_TDC status AUX_TDC:STAT.DONE
// AUX_TIMER0_EV        AUX timer 0 event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.TIMER0_EV
// AUX_TIMER1_EV        AUX timer 1 event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.TIMER1_EV
// AUX_SMPH_AUTOTAKE_DONE Autotake event from AUX semaphore, configured by
// AUX_SMPH:AUTOTAKE
// AUX_ADC_DONE         AUX ADC done, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.ADC_DONE
// AUX_ADC_FIFO_ALMOST_FULL AUX ADC FIFO watermark event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.ADC_FIFO_ALMOST_FULL
// AUX_OBSMUX0          Loopback of OBSMUX0 through AUX, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.OBSMUX0
//
// INTERNAL_NOTE:
// [Diagram showing the observtion signal top-level connections, this signal is
// bit 0 of the "to
// AUX"](https://spsemea.itg.ti.com/sites/lpw/proj/CC26xx/Modules/DFT/Observation_Signal_Design_Diagram%20-%20PG2%20-%20Revised%20Proposal.vsd)
// AUX_ADC_IRQ          AUX ADC interrupt event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.ADC_IRQ. Status flags are found here
// [AUX_EVCTL:EVTOMCUFLAGS.ADC*]
// AUX_SW_DMABREQ       AUX observation loopback
// AUX_DMASREQ          DMA single request event from AUX, configured by
// AUX_EVCTL:DMACTL
// AUX_DMABREQ          DMA burst request event from AUX, configured by
// AUX_EVCTL:DMACTL
// AON_RTC_UPD          RTC periodic event controlled by
// AON_RTC:CTL.RTC_UPD_EN
// CPU_HALTED           CPU halted
// ALWAYS_ACTIVE        Always asserted
//
#define EVENT_UDMACH14BSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH14BSEL_EV_S                                     0
#define EVENT_UDMACH14BSEL_EV_NONE                                  0x00000000
#define EVENT_UDMACH14BSEL_EV_AON_PROG0                             0x00000001
#define EVENT_UDMACH14BSEL_EV_AON_PROG1                             0x00000002
#define EVENT_UDMACH14BSEL_EV_AON_PROG2                             0x00000003
#define EVENT_UDMACH14BSEL_EV_AON_GPIO_EDGE                         0x00000004
#define EVENT_UDMACH14BSEL_EV_AON_SPIS_BYTE_DONE                    0x00000005
#define EVENT_UDMACH14BSEL_EV_AON_SPIS_CS                           0x00000006
#define EVENT_UDMACH14BSEL_EV_AON_RTC_COMB                          0x00000007
#define EVENT_UDMACH14BSEL_EV_I2S_IRQ                               0x00000008
#define EVENT_UDMACH14BSEL_EV_I2C_IRQ                               0x00000009
#define EVENT_UDMACH14BSEL_EV_AON_AUX_SWEV0                         0x0000000A
#define EVENT_UDMACH14BSEL_EV_AUX_COMB                              0x0000000B
#define EVENT_UDMACH14BSEL_EV_GPT2A                                 0x0000000C
#define EVENT_UDMACH14BSEL_EV_GPT2B                                 0x0000000D
#define EVENT_UDMACH14BSEL_EV_GPT3A                                 0x0000000E
#define EVENT_UDMACH14BSEL_EV_GPT3B                                 0x0000000F
#define EVENT_UDMACH14BSEL_EV_GPT0A                                 0x00000010
#define EVENT_UDMACH14BSEL_EV_GPT0B                                 0x00000011
#define EVENT_UDMACH14BSEL_EV_GPT1A                                 0x00000012
#define EVENT_UDMACH14BSEL_EV_GPT1B                                 0x00000013
#define EVENT_UDMACH14BSEL_EV_DMA_CH0_DONE                          0x00000014
#define EVENT_UDMACH14BSEL_EV_FLASH                                 0x00000015
#define EVENT_UDMACH14BSEL_EV_DMA_CH18_DONE                         0x00000016
#define EVENT_UDMACH14BSEL_EV_WDT_IRQ                               0x00000018
#define EVENT_UDMACH14BSEL_EV_RFC_CMD_ACK                           0x00000019
#define EVENT_UDMACH14BSEL_EV_RFC_HW_COMB                           0x0000001A
#define EVENT_UDMACH14BSEL_EV_RFC_CPE_0                             0x0000001B
#define EVENT_UDMACH14BSEL_EV_AUX_SWEV1                             0x0000001D
#define EVENT_UDMACH14BSEL_EV_RFC_CPE_1                             0x0000001E
#define EVENT_UDMACH14BSEL_EV_SSI0_COMB                             0x00000022
#define EVENT_UDMACH14BSEL_EV_SSI1_COMB                             0x00000023
#define EVENT_UDMACH14BSEL_EV_UART0_COMB                            0x00000024
#define EVENT_UDMACH14BSEL_EV_DMA_ERR                               0x00000026
#define EVENT_UDMACH14BSEL_EV_DMA_DONE_COMB                         0x00000027
#define EVENT_UDMACH14BSEL_EV_SSI0_RX_DMABREQ                       0x00000028
#define EVENT_UDMACH14BSEL_EV_SSI0_RX_DMASREQ                       0x00000029
#define EVENT_UDMACH14BSEL_EV_SSI0_TX_DMABREQ                       0x0000002A
#define EVENT_UDMACH14BSEL_EV_SSI0_TX_DMASREQ                       0x0000002B
#define EVENT_UDMACH14BSEL_EV_SSI1_RX_DMABREQ                       0x0000002C
#define EVENT_UDMACH14BSEL_EV_SSI1_RX_DMASREQ                       0x0000002D
#define EVENT_UDMACH14BSEL_EV_SSI1_TX_DMABREQ                       0x0000002E
#define EVENT_UDMACH14BSEL_EV_SSI1_TX_DMASREQ                       0x0000002F
#define EVENT_UDMACH14BSEL_EV_UART0_RX_DMABREQ                      0x00000030
#define EVENT_UDMACH14BSEL_EV_UART0_RX_DMASREQ                      0x00000031
#define EVENT_UDMACH14BSEL_EV_UART0_TX_DMABREQ                      0x00000032
#define EVENT_UDMACH14BSEL_EV_UART0_TX_DMASREQ                      0x00000033
#define EVENT_UDMACH14BSEL_EV_SPIS_COMB                             0x00000038
#define EVENT_UDMACH14BSEL_EV_SPIS_RXF_DMABREQ                      0x00000039
#define EVENT_UDMACH14BSEL_EV_SPIS_RXF_DMASREQ                      0x0000003A
#define EVENT_UDMACH14BSEL_EV_SPIS_TXF_DMABREQ                      0x0000003B
#define EVENT_UDMACH14BSEL_EV_SPIS_TXF_DMASREQ                      0x0000003C
#define EVENT_UDMACH14BSEL_EV_GPT0A_CMP                             0x0000003D
#define EVENT_UDMACH14BSEL_EV_GPT0B_CMP                             0x0000003E
#define EVENT_UDMACH14BSEL_EV_GPT1A_CMP                             0x0000003F
#define EVENT_UDMACH14BSEL_EV_GPT1B_CMP                             0x00000040
#define EVENT_UDMACH14BSEL_EV_GPT2A_CMP                             0x00000041
#define EVENT_UDMACH14BSEL_EV_GPT2B_CMP                             0x00000042
#define EVENT_UDMACH14BSEL_EV_GPT3A_CMP                             0x00000043
#define EVENT_UDMACH14BSEL_EV_GPT3B_CMP                             0x00000044
#define EVENT_UDMACH14BSEL_EV_GPT0A_DMABREQ                         0x0000004D
#define EVENT_UDMACH14BSEL_EV_GPT0B_DMABREQ                         0x0000004E
#define EVENT_UDMACH14BSEL_EV_GPT1A_DMABREQ                         0x0000004F
#define EVENT_UDMACH14BSEL_EV_GPT1B_DMABREQ                         0x00000050
#define EVENT_UDMACH14BSEL_EV_GPT2A_DMABREQ                         0x00000051
#define EVENT_UDMACH14BSEL_EV_GPT2B_DMABREQ                         0x00000052
#define EVENT_UDMACH14BSEL_EV_GPT3A_DMABREQ                         0x00000053
#define EVENT_UDMACH14BSEL_EV_GPT3B_DMABREQ                         0x00000054
#define EVENT_UDMACH14BSEL_EV_PORT_EVENT0                           0x00000055
#define EVENT_UDMACH14BSEL_EV_PORT_EVENT1                           0x00000056
#define EVENT_UDMACH14BSEL_EV_PORT_EVENT2                           0x00000057
#define EVENT_UDMACH14BSEL_EV_PORT_EVENT3                           0x00000058
#define EVENT_UDMACH14BSEL_EV_PORT_EVENT4                           0x00000059
#define EVENT_UDMACH14BSEL_EV_PORT_EVENT5                           0x0000005A
#define EVENT_UDMACH14BSEL_EV_PORT_EVENT6                           0x0000005B
#define EVENT_UDMACH14BSEL_EV_PORT_EVENT7                           0x0000005C
#define EVENT_UDMACH14BSEL_EV_CRYPTO_RESULT_AVAIL_IRQ               0x0000005D
#define EVENT_UDMACH14BSEL_EV_CRYPTO_DMA_DONE_IRQ                   0x0000005E
#define EVENT_UDMACH14BSEL_EV_RFC_IN_EV4                            0x0000005F
#define EVENT_UDMACH14BSEL_EV_RFC_IN_EV5                            0x00000060
#define EVENT_UDMACH14BSEL_EV_RFC_IN_EV6                            0x00000061
#define EVENT_UDMACH14BSEL_EV_RFC_IN_EV7                            0x00000062
#define EVENT_UDMACH14BSEL_EV_WDT_NMI                               0x00000063
#define EVENT_UDMACH14BSEL_EV_SWEV0                                 0x00000064
#define EVENT_UDMACH14BSEL_EV_SWEV1                                 0x00000065
#define EVENT_UDMACH14BSEL_EV_SWEV2                                 0x00000066
#define EVENT_UDMACH14BSEL_EV_SWEV3                                 0x00000067
#define EVENT_UDMACH14BSEL_EV_TRNG_IRQ                              0x00000068
#define EVENT_UDMACH14BSEL_EV_AUX_AON_WU_EV                         0x00000069
#define EVENT_UDMACH14BSEL_EV_AUX_COMPA                             0x0000006A
#define EVENT_UDMACH14BSEL_EV_AUX_COMPB                             0x0000006B
#define EVENT_UDMACH14BSEL_EV_AUX_TDC_DONE                          0x0000006C
#define EVENT_UDMACH14BSEL_EV_AUX_TIMER0_EV                         0x0000006D
#define EVENT_UDMACH14BSEL_EV_AUX_TIMER1_EV                         0x0000006E
#define EVENT_UDMACH14BSEL_EV_AUX_SMPH_AUTOTAKE_DONE                0x0000006F
#define EVENT_UDMACH14BSEL_EV_AUX_ADC_DONE                          0x00000070
#define EVENT_UDMACH14BSEL_EV_AUX_ADC_FIFO_ALMOST_FULL              0x00000071
#define EVENT_UDMACH14BSEL_EV_AUX_OBSMUX0                           0x00000072
#define EVENT_UDMACH14BSEL_EV_AUX_ADC_IRQ                           0x00000073
#define EVENT_UDMACH14BSEL_EV_AUX_SW_DMABREQ                        0x00000074
#define EVENT_UDMACH14BSEL_EV_AUX_DMASREQ                           0x00000075
#define EVENT_UDMACH14BSEL_EV_AUX_DMABREQ                           0x00000076
#define EVENT_UDMACH14BSEL_EV_AON_RTC_UPD                           0x00000077
#define EVENT_UDMACH14BSEL_EV_CPU_HALTED                            0x00000078
#define EVENT_UDMACH14BSEL_EV_ALWAYS_ACTIVE                         0x00000079

//*****************************************************************************
//
// Register: EVENT_O_UDMACH15BSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// AON_RTC_COMB         Event from AON_RTC controlled by the
// AON_RTC:CTL.COMB_EV_MASK setting
//
#define EVENT_UDMACH15BSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH15BSEL_EV_S                                     0
#define EVENT_UDMACH15BSEL_EV_AON_RTC_COMB                          0x00000007

//*****************************************************************************
//
// Register: EVENT_O_UDMACH16SSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// SSI1_RX_DMASREQ      SSI1 RX DMA single request, controlled by
// SSI0:DMACR.RXDMAE
//
#define EVENT_UDMACH16SSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH16SSEL_EV_S                                     0
#define EVENT_UDMACH16SSEL_EV_SSI1_RX_DMASREQ                       0x0000002D

//*****************************************************************************
//
// Register: EVENT_O_UDMACH16BSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// SSI1_RX_DMABREQ      SSI1 RX DMA burst request , controlled by
// SSI0:DMACR.RXDMAE
//
#define EVENT_UDMACH16BSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH16BSEL_EV_S                                     0
#define EVENT_UDMACH16BSEL_EV_SSI1_RX_DMABREQ                       0x0000002C

//*****************************************************************************
//
// Register: EVENT_O_UDMACH17SSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// SSI1_TX_DMASREQ      SSI1 TX DMA single request, controlled by
// SSI0:DMACR.TXDMAE
//
#define EVENT_UDMACH17SSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH17SSEL_EV_S                                     0
#define EVENT_UDMACH17SSEL_EV_SSI1_TX_DMASREQ                       0x0000002F

//*****************************************************************************
//
// Register: EVENT_O_UDMACH17BSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// SSI1_TX_DMABREQ      SSI1 TX DMA burst request , controlled by
// SSI0:DMACR.TXDMAE
//
#define EVENT_UDMACH17BSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH17BSEL_EV_S                                     0
#define EVENT_UDMACH17BSEL_EV_SSI1_TX_DMABREQ                       0x0000002E

//*****************************************************************************
//
// Register: EVENT_O_UDMACH21SSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// SWEV0                Software event 0, triggered by SWEV.SWEV0
//
#define EVENT_UDMACH21SSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH21SSEL_EV_S                                     0
#define EVENT_UDMACH21SSEL_EV_SWEV0                                 0x00000064

//*****************************************************************************
//
// Register: EVENT_O_UDMACH21BSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// SWEV0                Software event 0, triggered by SWEV.SWEV0
//
#define EVENT_UDMACH21BSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH21BSEL_EV_S                                     0
#define EVENT_UDMACH21BSEL_EV_SWEV0                                 0x00000064

//*****************************************************************************
//
// Register: EVENT_O_UDMACH22SSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// SWEV1                Software event 1, triggered by SWEV.SWEV1
//
#define EVENT_UDMACH22SSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH22SSEL_EV_S                                     0
#define EVENT_UDMACH22SSEL_EV_SWEV1                                 0x00000065

