contiki-os/contiki/cc26xxware/inc/hw_event.h
//*****************************************************************************
//
// Register: EVENT_O_UDMACH22BSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// SWEV1                Software event 1, triggered by SWEV.SWEV1
//
#define EVENT_UDMACH22BSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH22BSEL_EV_S                                     0
#define EVENT_UDMACH22BSEL_EV_SWEV1                                 0x00000065

//*****************************************************************************
//
// Register: EVENT_O_UDMACH23SSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// SWEV2                Software event 2, triggered by SWEV.SWEV2
//
#define EVENT_UDMACH23SSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH23SSEL_EV_S                                     0
#define EVENT_UDMACH23SSEL_EV_SWEV2                                 0x00000066

//*****************************************************************************
//
// Register: EVENT_O_UDMACH23BSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// SWEV2                Software event 2, triggered by SWEV.SWEV2
//
#define EVENT_UDMACH23BSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH23BSEL_EV_S                                     0
#define EVENT_UDMACH23BSEL_EV_SWEV2                                 0x00000066

//*****************************************************************************
//
// Register: EVENT_O_UDMACH24SSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// SWEV3                Software event 3, triggered by SWEV.SWEV3
//
#define EVENT_UDMACH24SSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH24SSEL_EV_S                                     0
#define EVENT_UDMACH24SSEL_EV_SWEV3                                 0x00000067

//*****************************************************************************
//
// Register: EVENT_O_UDMACH24BSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// SWEV3                Software event 3, triggered by SWEV.SWEV3
//
#define EVENT_UDMACH24BSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH24BSEL_EV_S                                     0
#define EVENT_UDMACH24BSEL_EV_SWEV3                                 0x00000067

//*****************************************************************************
//
// Register: EVENT_O_GPT3ACAPTSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read/write selection value
// ENUMs:
// NONE                 Always inactive
// AON_GPIO_EDGE        Edge detect event from IOC. Configureded by the
// [IOC:IOCFGn.EDGE_IRQ_EN] and  [IOC:IOCFGn.EDGE_DET] settings
// AON_SPIS_BYTE_DONE   A complete byte transfer event from the SPIS. Equivalent
// to the SPIS:GPFLAGS.BYTE_DONE flag
// AON_SPIS_CS          SPIS chip select event. Equivalent to the
// SPIS:GPFLAGS.CS flag
// AON_RTC_COMB         Event from AON_RTC controlled by the
// AON_RTC:CTL.COMB_EV_MASK setting
// AUX_COMB             AUX combined event, the corresponding flag register is
// here AUX_EVCTL:EVTOMCUFLAGS
// FLASH                FLASH controller error event,  the status flags are
// FLASH:FEDACSTAT.FSM_DONE and FLASH:FEDACSTAT.RVF_INT
// RFC_CMD_ACK          RFC Doorbell Command Acknowledgement Interrupt,
// equvialent to RFC_DBELL:RFACKIFG.ACKFLAG
// RFC_HW_COMB          Combined RCF hardware interrupt, corresponding flag is
// here RFC_DBELL:RFHWIFG
// RFC_CPE_0            Combined Interrupt for CPE Generated events.
// Corresponding flags are here RFC_DBELL:RFCPEIFG. Only interrupts selected
// with CPE0 in RFC_DBELL:RFCPEIFG can trigger a RFC_CPE_0 event
// RFC_CPE_1            Combined Interrupt for CPE Generated events.
// Corresponding flags are here RFC_DBELL:RFCPEIFG. Only interrupts selected
// with CPE1 in RFC_DBELL:RFCPEIFG can trigger a RFC_CPE_1 event
// SSI0_COMB            SSI0 combined interrupt, interrupt flags are found here
// SSI0:MIS
// SSI1_COMB            SSI0 combined interrupt, interrupt flags are found here
// SSI1:MIS
// UART0_COMB           UART0 combined interrupt, interrupt flags are found here
// UART0:MIS
// GPT0A_CMP            GPT0A compare event. Configured by GPT0:TAMR.TCACT
// GPT0B_CMP            GPT0B compare event. Configured by GPT0:TBMR.TCACT
// GPT1A_CMP            GPT1A compare event. Configured by GPT1:TAMR.TCACT
// GPT1B_CMP            GPT1B compare event. Configured by GPT1:TBMR.TCACT
// GPT2A_CMP            GPT2A compare event. Configured by GPT2:TAMR.TCACT
// GPT2B_CMP            GPT2B compare event. Configured by GPT2:TBMR.TCACT
// GPT3A_CMP            GPT3A compare event. Configured by GPT3:TAMR.TCACT
// GPT3B_CMP            GPT3B compare event. Configured by GPT3:TBMR.TCACT
// PORT_EVENT6          Port capture event from IOC, configured by
// [IOC:IOCFGn.PORT_ID]. Events on ports configured with ENUM PORT_EVENT6 wil be
// routed here.
// PORT_EVENT7          Port capture event from IOC, configured by
// [IOC:IOCFGn.PORT_ID]. Events on ports configured with ENUM PORT_EVENT7 wil be
// routed here.
// RFC_IN_EV6           RFC RAT event 6, configured by RFC_RAT:RATEV.OEVT6
// RFC_IN_EV7           RFC RAT event 7, configured by RFC_RAT:RATEV.OEVT7
// AUX_AON_WU_EV        AON wakeup event, corresponds flags are here
// AUX_EVCTL:EVTOMCUFLAGS.AON_WU_EV
// AUX_COMPA            AUX Compare A event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPA
// AUX_COMPB            AUX Compare B event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPB
// AUX_TDC_DONE         AUX TDC measurement done event, corresponds to the flag
// AUX_EVCTL:EVTOMCUFLAGS.TDC_DONE and the AUX_TDC status AUX_TDC:STAT.DONE
// AUX_TIMER0_EV        AUX timer 0 event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.TIMER0_EV
// AUX_TIMER1_EV        AUX timer 1 event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.TIMER1_EV
// AUX_SMPH_AUTOTAKE_DONE Autotake event from AUX semaphore, configured by
// AUX_SMPH:AUTOTAKE
// AUX_ADC_DONE         AUX ADC done, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.ADC_DONE
// AUX_ADC_FIFO_ALMOST_FULL AUX ADC FIFO watermark event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.ADC_FIFO_ALMOST_FULL
// AUX_OBSMUX0          Loopback of OBSMUX0 through AUX, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.OBSMUX0
//
// INTERNAL_NOTE:
// [Diagram showing the observtion signal top-level connections, this signal is
// bit 0 of the "to
// AUX"](https://spsemea.itg.ti.com/sites/lpw/proj/CC26xx/Modules/DFT/Observation_Signal_Design_Diagram%20-%20PG2%20-%20Revised%20Proposal.vsd)
// AUX_ADC_IRQ          AUX ADC interrupt event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.ADC_IRQ. Status flags are found here
// [AUX_EVCTL:EVTOMCUFLAGS.ADC*]
// AON_RTC_UPD          RTC periodic event controlled by
// AON_RTC:CTL.RTC_UPD_EN
// ALWAYS_ACTIVE        Always asserted
//
#define EVENT_GPT3ACAPTSEL_EV_M                                     0x0000007F
#define EVENT_GPT3ACAPTSEL_EV_S                                     0
#define EVENT_GPT3ACAPTSEL_EV_NONE                                  0x00000000
#define EVENT_GPT3ACAPTSEL_EV_AON_GPIO_EDGE                         0x00000004
#define EVENT_GPT3ACAPTSEL_EV_AON_SPIS_BYTE_DONE                    0x00000005
#define EVENT_GPT3ACAPTSEL_EV_AON_SPIS_CS                           0x00000006
#define EVENT_GPT3ACAPTSEL_EV_AON_RTC_COMB                          0x00000007
#define EVENT_GPT3ACAPTSEL_EV_AUX_COMB                              0x0000000B
#define EVENT_GPT3ACAPTSEL_EV_FLASH                                 0x00000015
#define EVENT_GPT3ACAPTSEL_EV_RFC_CMD_ACK                           0x00000019
#define EVENT_GPT3ACAPTSEL_EV_RFC_HW_COMB                           0x0000001A
#define EVENT_GPT3ACAPTSEL_EV_RFC_CPE_0                             0x0000001B
#define EVENT_GPT3ACAPTSEL_EV_RFC_CPE_1                             0x0000001E
#define EVENT_GPT3ACAPTSEL_EV_SSI0_COMB                             0x00000022
#define EVENT_GPT3ACAPTSEL_EV_SSI1_COMB                             0x00000023
#define EVENT_GPT3ACAPTSEL_EV_UART0_COMB                            0x00000024
#define EVENT_GPT3ACAPTSEL_EV_GPT0A_CMP                             0x0000003D
#define EVENT_GPT3ACAPTSEL_EV_GPT0B_CMP                             0x0000003E
#define EVENT_GPT3ACAPTSEL_EV_GPT1A_CMP                             0x0000003F
#define EVENT_GPT3ACAPTSEL_EV_GPT1B_CMP                             0x00000040
#define EVENT_GPT3ACAPTSEL_EV_GPT2A_CMP                             0x00000041
#define EVENT_GPT3ACAPTSEL_EV_GPT2B_CMP                             0x00000042
#define EVENT_GPT3ACAPTSEL_EV_GPT3A_CMP                             0x00000043
#define EVENT_GPT3ACAPTSEL_EV_GPT3B_CMP                             0x00000044
#define EVENT_GPT3ACAPTSEL_EV_PORT_EVENT6                           0x0000005B
#define EVENT_GPT3ACAPTSEL_EV_PORT_EVENT7                           0x0000005C
#define EVENT_GPT3ACAPTSEL_EV_RFC_IN_EV6                            0x00000061
#define EVENT_GPT3ACAPTSEL_EV_RFC_IN_EV7                            0x00000062
#define EVENT_GPT3ACAPTSEL_EV_AUX_AON_WU_EV                         0x00000069
#define EVENT_GPT3ACAPTSEL_EV_AUX_COMPA                             0x0000006A
#define EVENT_GPT3ACAPTSEL_EV_AUX_COMPB                             0x0000006B
#define EVENT_GPT3ACAPTSEL_EV_AUX_TDC_DONE                          0x0000006C
#define EVENT_GPT3ACAPTSEL_EV_AUX_TIMER0_EV                         0x0000006D
#define EVENT_GPT3ACAPTSEL_EV_AUX_TIMER1_EV                         0x0000006E
#define EVENT_GPT3ACAPTSEL_EV_AUX_SMPH_AUTOTAKE_DONE                0x0000006F
#define EVENT_GPT3ACAPTSEL_EV_AUX_ADC_DONE                          0x00000070
#define EVENT_GPT3ACAPTSEL_EV_AUX_ADC_FIFO_ALMOST_FULL              0x00000071
#define EVENT_GPT3ACAPTSEL_EV_AUX_OBSMUX0                           0x00000072
#define EVENT_GPT3ACAPTSEL_EV_AUX_ADC_IRQ                           0x00000073
#define EVENT_GPT3ACAPTSEL_EV_AON_RTC_UPD                           0x00000077
#define EVENT_GPT3ACAPTSEL_EV_ALWAYS_ACTIVE                         0x00000079

//*****************************************************************************
//
// Register: EVENT_O_GPT3BCAPTSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read/write selection value
// ENUMs:
// NONE                 Always inactive
// AON_GPIO_EDGE        Edge detect event from IOC. Configureded by the
// [IOC:IOCFGn.EDGE_IRQ_EN] and  [IOC:IOCFGn.EDGE_DET] settings
// AON_SPIS_BYTE_DONE   A complete byte transfer event from the SPIS. Equivalent
// to the SPIS:GPFLAGS.BYTE_DONE flag
// AON_SPIS_CS          SPIS chip select event. Equivalent to the
// SPIS:GPFLAGS.CS flag
// AON_RTC_COMB         Event from AON_RTC controlled by the
// AON_RTC:CTL.COMB_EV_MASK setting
// AUX_COMB             AUX combined event, the corresponding flag register is
// here AUX_EVCTL:EVTOMCUFLAGS
// FLASH                FLASH controller error event,  the status flags are
// FLASH:FEDACSTAT.FSM_DONE and FLASH:FEDACSTAT.RVF_INT
// RFC_CMD_ACK          RFC Doorbell Command Acknowledgement Interrupt,
// equvialent to RFC_DBELL:RFACKIFG.ACKFLAG
// RFC_HW_COMB          Combined RCF hardware interrupt, corresponding flag is
// here RFC_DBELL:RFHWIFG
// RFC_CPE_0            Combined Interrupt for CPE Generated events.
// Corresponding flags are here RFC_DBELL:RFCPEIFG. Only interrupts selected
// with CPE0 in RFC_DBELL:RFCPEIFG can trigger a RFC_CPE_0 event
// RFC_CPE_1            Combined Interrupt for CPE Generated events.
// Corresponding flags are here RFC_DBELL:RFCPEIFG. Only interrupts selected
// with CPE1 in RFC_DBELL:RFCPEIFG can trigger a RFC_CPE_1 event
// SSI0_COMB            SSI0 combined interrupt, interrupt flags are found here
// SSI0:MIS
// SSI1_COMB            SSI0 combined interrupt, interrupt flags are found here
// SSI1:MIS
// UART0_COMB           UART0 combined interrupt, interrupt flags are found here
// UART0:MIS
// GPT0A_CMP            GPT0A compare event. Configured by GPT0:TAMR.TCACT
// GPT0B_CMP            GPT0B compare event. Configured by GPT0:TBMR.TCACT
// GPT1A_CMP            GPT1A compare event. Configured by GPT1:TAMR.TCACT
// GPT1B_CMP            GPT1B compare event. Configured by GPT1:TBMR.TCACT
// GPT2A_CMP            GPT2A compare event. Configured by GPT2:TAMR.TCACT
// GPT2B_CMP            GPT2B compare event. Configured by GPT2:TBMR.TCACT
// GPT3A_CMP            GPT3A compare event. Configured by GPT3:TAMR.TCACT
// GPT3B_CMP            GPT3B compare event. Configured by GPT3:TBMR.TCACT
// PORT_EVENT6          Port capture event from IOC, configured by
// [IOC:IOCFGn.PORT_ID]. Events on ports configured with ENUM PORT_EVENT6 wil be
// routed here.
// PORT_EVENT7          Port capture event from IOC, configured by
// [IOC:IOCFGn.PORT_ID]. Events on ports configured with ENUM PORT_EVENT7 wil be
// routed here.
// RFC_IN_EV6           RFC RAT event 6, configured by RFC_RAT:RATEV.OEVT6
// RFC_IN_EV7           RFC RAT event 7, configured by RFC_RAT:RATEV.OEVT7
// AUX_AON_WU_EV        AON wakeup event, corresponds flags are here
// AUX_EVCTL:EVTOMCUFLAGS.AON_WU_EV
// AUX_COMPA            AUX Compare A event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPA
// AUX_COMPB            AUX Compare B event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPB
// AUX_TDC_DONE         AUX TDC measurement done event, corresponds to the flag
// AUX_EVCTL:EVTOMCUFLAGS.TDC_DONE and the AUX_TDC status AUX_TDC:STAT.DONE
// AUX_TIMER0_EV        AUX timer 0 event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.TIMER0_EV
// AUX_TIMER1_EV        AUX timer 1 event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.TIMER1_EV
// AUX_SMPH_AUTOTAKE_DONE Autotake event from AUX semaphore, configured by
// AUX_SMPH:AUTOTAKE
// AUX_ADC_DONE         AUX ADC done, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.ADC_DONE
// AUX_ADC_FIFO_ALMOST_FULL AUX ADC FIFO watermark event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.ADC_FIFO_ALMOST_FULL
// AUX_OBSMUX0          Loopback of OBSMUX0 through AUX, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.OBSMUX0
//
// INTERNAL_NOTE:
// [Diagram showing the observtion signal top-level connections, this signal is
// bit 0 of the "to
// AUX"](https://spsemea.itg.ti.com/sites/lpw/proj/CC26xx/Modules/DFT/Observation_Signal_Design_Diagram%20-%20PG2%20-%20Revised%20Proposal.vsd)
// AUX_ADC_IRQ          AUX ADC interrupt event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.ADC_IRQ. Status flags are found here
// [AUX_EVCTL:EVTOMCUFLAGS.ADC*]
// AON_RTC_UPD          RTC periodic event controlled by
// AON_RTC:CTL.RTC_UPD_EN
// ALWAYS_ACTIVE        Always asserted
//
#define EVENT_GPT3BCAPTSEL_EV_M                                     0x0000007F
#define EVENT_GPT3BCAPTSEL_EV_S                                     0
#define EVENT_GPT3BCAPTSEL_EV_NONE                                  0x00000000
#define EVENT_GPT3BCAPTSEL_EV_AON_GPIO_EDGE                         0x00000004
#define EVENT_GPT3BCAPTSEL_EV_AON_SPIS_BYTE_DONE                    0x00000005
#define EVENT_GPT3BCAPTSEL_EV_AON_SPIS_CS                           0x00000006
#define EVENT_GPT3BCAPTSEL_EV_AON_RTC_COMB                          0x00000007
#define EVENT_GPT3BCAPTSEL_EV_AUX_COMB                              0x0000000B
#define EVENT_GPT3BCAPTSEL_EV_FLASH                                 0x00000015
#define EVENT_GPT3BCAPTSEL_EV_RFC_CMD_ACK                           0x00000019
#define EVENT_GPT3BCAPTSEL_EV_RFC_HW_COMB                           0x0000001A
#define EVENT_GPT3BCAPTSEL_EV_RFC_CPE_0                             0x0000001B
#define EVENT_GPT3BCAPTSEL_EV_RFC_CPE_1                             0x0000001E
#define EVENT_GPT3BCAPTSEL_EV_SSI0_COMB                             0x00000022
#define EVENT_GPT3BCAPTSEL_EV_SSI1_COMB                             0x00000023
#define EVENT_GPT3BCAPTSEL_EV_UART0_COMB                            0x00000024
#define EVENT_GPT3BCAPTSEL_EV_GPT0A_CMP                             0x0000003D
#define EVENT_GPT3BCAPTSEL_EV_GPT0B_CMP                             0x0000003E
#define EVENT_GPT3BCAPTSEL_EV_GPT1A_CMP                             0x0000003F
#define EVENT_GPT3BCAPTSEL_EV_GPT1B_CMP                             0x00000040
#define EVENT_GPT3BCAPTSEL_EV_GPT2A_CMP                             0x00000041
#define EVENT_GPT3BCAPTSEL_EV_GPT2B_CMP                             0x00000042
#define EVENT_GPT3BCAPTSEL_EV_GPT3A_CMP                             0x00000043
#define EVENT_GPT3BCAPTSEL_EV_GPT3B_CMP                             0x00000044
#define EVENT_GPT3BCAPTSEL_EV_PORT_EVENT6                           0x0000005B
#define EVENT_GPT3BCAPTSEL_EV_PORT_EVENT7                           0x0000005C
#define EVENT_GPT3BCAPTSEL_EV_RFC_IN_EV6                            0x00000061
#define EVENT_GPT3BCAPTSEL_EV_RFC_IN_EV7                            0x00000062
#define EVENT_GPT3BCAPTSEL_EV_AUX_AON_WU_EV                         0x00000069
#define EVENT_GPT3BCAPTSEL_EV_AUX_COMPA                             0x0000006A
#define EVENT_GPT3BCAPTSEL_EV_AUX_COMPB                             0x0000006B
#define EVENT_GPT3BCAPTSEL_EV_AUX_TDC_DONE                          0x0000006C
#define EVENT_GPT3BCAPTSEL_EV_AUX_TIMER0_EV                         0x0000006D
#define EVENT_GPT3BCAPTSEL_EV_AUX_TIMER1_EV                         0x0000006E
#define EVENT_GPT3BCAPTSEL_EV_AUX_SMPH_AUTOTAKE_DONE                0x0000006F
#define EVENT_GPT3BCAPTSEL_EV_AUX_ADC_DONE                          0x00000070
#define EVENT_GPT3BCAPTSEL_EV_AUX_ADC_FIFO_ALMOST_FULL              0x00000071
#define EVENT_GPT3BCAPTSEL_EV_AUX_OBSMUX0                           0x00000072
#define EVENT_GPT3BCAPTSEL_EV_AUX_ADC_IRQ                           0x00000073
#define EVENT_GPT3BCAPTSEL_EV_AON_RTC_UPD                           0x00000077
#define EVENT_GPT3BCAPTSEL_EV_ALWAYS_ACTIVE                         0x00000079

//*****************************************************************************
//
// Register: EVENT_O_AUXSEL0
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read/write selection value
// ENUMs:
// NONE                 Always inactive
// GPT2A                GPT2A interrupt event, controlled by GPT2:TAMR
// GPT2B                GPT2B interrupt event, controlled by GPT2:TBMR
// GPT3A                GPT3A interrupt event, controlled by GPT3:TAMR
// GPT3B                GPT3B interrupt event, controlled by GPT3:TBMR
// GPT0A                GPT0A interrupt event, controlled by GPT0:TAMR
// GPT0B                GPT0B interrupt event, controlled by GPT0:TBMR
// GPT1A                GPT1A interrupt event, controlled by GPT1:TAMR
// GPT1B                GPT1B interrupt event, controlled by GPT1:TBMR
// ALWAYS_ACTIVE        Always asserted
//
#define EVENT_AUXSEL0_EV_M                                          0x0000007F
#define EVENT_AUXSEL0_EV_S                                          0
#define EVENT_AUXSEL0_EV_NONE                                       0x00000000
#define EVENT_AUXSEL0_EV_GPT2A                                      0x0000000C
#define EVENT_AUXSEL0_EV_GPT2B                                      0x0000000D
#define EVENT_AUXSEL0_EV_GPT3A                                      0x0000000E
#define EVENT_AUXSEL0_EV_GPT3B                                      0x0000000F
#define EVENT_AUXSEL0_EV_GPT0A                                      0x00000010
#define EVENT_AUXSEL0_EV_GPT0B                                      0x00000011
#define EVENT_AUXSEL0_EV_GPT1A                                      0x00000012
#define EVENT_AUXSEL0_EV_GPT1B                                      0x00000013
#define EVENT_AUXSEL0_EV_ALWAYS_ACTIVE                              0x00000079

//*****************************************************************************
//
// Register: EVENT_O_CM3NMISEL0
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// WDT_NMI              Watchdog non maskable interrupt event, controlled by
// WDT:CTL.INTTYPE
//
#define EVENT_CM3NMISEL0_EV_M                                       0x0000007F
#define EVENT_CM3NMISEL0_EV_S                                       0
#define EVENT_CM3NMISEL0_EV_WDT_NMI                                 0x00000063

//*****************************************************************************
//
// Register: EVENT_O_I2SSTMPSEL0
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read/write selection value
// ENUMs:
// NONE                 Always inactive
// RFC_IN_EV4           RFC RAT event 4, configured by RFC_RAT:RATEV.OEVT4
// RFC_IN_EV5           RFC RAT event 5, configured by RFC_RAT:RATEV.OEVT5
// RFC_IN_EV6           RFC RAT event 6, configured by RFC_RAT:RATEV.OEVT6
// RFC_IN_EV7           RFC RAT event 7, configured by RFC_RAT:RATEV.OEVT7
// ALWAYS_ACTIVE        Always asserted
//
#define EVENT_I2SSTMPSEL0_EV_M                                      0x0000007F
#define EVENT_I2SSTMPSEL0_EV_S                                      0
#define EVENT_I2SSTMPSEL0_EV_NONE                                   0x00000000
#define EVENT_I2SSTMPSEL0_EV_RFC_IN_EV4                             0x0000005F
#define EVENT_I2SSTMPSEL0_EV_RFC_IN_EV5                             0x00000060
#define EVENT_I2SSTMPSEL0_EV_RFC_IN_EV6                             0x00000061
#define EVENT_I2SSTMPSEL0_EV_RFC_IN_EV7                             0x00000062
#define EVENT_I2SSTMPSEL0_EV_ALWAYS_ACTIVE                          0x00000079

//*****************************************************************************
//
// Register: EVENT_O_FRZSEL0
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read/write selection value
// ENUMs:
// NONE                 Always inactive
// CPU_HALTED           CPU halted
// ALWAYS_ACTIVE        Always asserted
//
#define EVENT_FRZSEL0_EV_M                                          0x0000007F
#define EVENT_FRZSEL0_EV_S                                          0
#define EVENT_FRZSEL0_EV_NONE                                       0x00000000
#define EVENT_FRZSEL0_EV_CPU_HALTED                                 0x00000078
#define EVENT_FRZSEL0_EV_ALWAYS_ACTIVE                              0x00000079

//*****************************************************************************
//
// Register: EVENT_O_SWEV
//
//*****************************************************************************
// Field: [24]    SWEV3
//
// Writing &quot;1&quot; to this bit when the value is &quot;0&quot; triggers the
// Software 3 event.
#define EVENT_SWEV_SWEV3                                            0x01000000
#define EVENT_SWEV_SWEV3_BITN                                       24
#define EVENT_SWEV_SWEV3_M                                          0x01000000
#define EVENT_SWEV_SWEV3_S                                          24

// Field: [16]    SWEV2
//
// Writing &quot;1&quot; to this bit when the value is &quot;0&quot; triggers the
// Software 2 event.
#define EVENT_SWEV_SWEV2                                            0x00010000
#define EVENT_SWEV_SWEV2_BITN                                       16
#define EVENT_SWEV_SWEV2_M                                          0x00010000
#define EVENT_SWEV_SWEV2_S                                          16

// Field: [8]    SWEV1
//
// Writing &quot;1&quot; to this bit when the value is &quot;0&quot; triggers the
// Software 1 event.
#define EVENT_SWEV_SWEV1                                            0x00000100
#define EVENT_SWEV_SWEV1_BITN                                       8
#define EVENT_SWEV_SWEV1_M                                          0x00000100
#define EVENT_SWEV_SWEV1_S                                          8

// Field: [0]    SWEV0
//
// Writing &quot;1&quot; to this bit when the value is &quot;0&quot; triggers the
// Software 0 event.
#define EVENT_SWEV_SWEV0                                            0x00000001
#define EVENT_SWEV_SWEV0_BITN                                       0
#define EVENT_SWEV_SWEV0_M                                          0x00000001
#define EVENT_SWEV_SWEV0_S                                          0

#endif // __HW_EVENT_H__
